works fine. Thanks im closing issue.

```
terraform apply

Terraform used the selected providers to generate the following execution plan.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # ciscoise_network_access_conditions.conditions will be created
  + resource "ciscoise_network_access_conditions" "conditions" {
      + id           = (known after apply)
      + item         = (known after apply)
      + last_updated = (known after apply)

      + parameters {
          + attribute_name      = (known after apply)
          + attribute_value     = (known after apply)
          + condition_type      = "LibraryConditionAndBlock"
          + description         = (known after apply)
          + dictionary_name     = (known after apply)
          + dictionary_value    = (known after apply)
          + id                  = (known after apply)
          + is_negate           = "false"
          + link                = (known after apply)
          + name                = "condtion_11"
          + operator            = (known after apply)
          + week_days           = (known after apply)
          + week_days_exception = (known after apply)

          + children {
              + attribute_name   = "Location"
              + attribute_value  = "All Locations"
              + condition_type   = "ConditionAttributes"
              + description      = (known after apply)
              + dictionary_name  = "DEVICE"
              + dictionary_value = (known after apply)
              + id               = (known after apply)
              + is_negate        = "false"
              + link             = (known after apply)
              + name             = (known after apply)
              + operator         = "equals"
            }
          + children {
              + attribute_name   = "Device Type"
              + attribute_value  = "All Device Types"
              + condition_type   = "ConditionAttributes"
              + description      = (known after apply)
              + dictionary_name  = "DEVICE"
              + dictionary_value = (known after apply)
              + id               = (known after apply)
              + is_negate        = "false"
              + link             = (known after apply)
              + name             = (known after apply)
              + operator         = "equals"
            }
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

ciscoise_network_access_conditions.conditions: Creating...
ciscoise_network_access_conditions.conditions: Creation complete after 0s [id=id:=77b1a015-31c8-4a58-bddd-5ea1e44e1d23\name:=condtion_11]

Apply complete! Resources: 1 added, 0 changed, 0 destroyed.
```